판다스 - 데이터분석도구 (Numpy 기반)   
- 구성요소 3가지   
    - Series: 1개의 컬럼값만으로 1차원 데이터셋(array in NumPy)   
    - DataFrame: Column x Row 2차원 데이터셋(테이블구조)   
    - Index: 고유한 키값

In [81]:
import pandas as pd
import matplotlib.pyplot as plt

ImportError: DLL load failed while importing _path: 지정된 모듈을 찾을 수 없습니다.

In [82]:
# 예시 데이터프레임 생성
data = {
    "USD" : [1.1, 1.2, 1.3, 1.4, 1.5]
    "EUR" : [1.3, 1.4, 1.5, 1.6, 1.7]
}
df = pd.Dataframe(data)

SyntaxError: invalid syntax (2291601417.py, line 4)

#### Series 구조   
 - Pandas가 제공하는 객체   
 - 객체 생성: 생성자 호출 - 전변 초기화 - 파라미터에 아무 것도 없는 것: 디폴트 생성자   
 - pd는 Series의 소유주이다.   
 - Series(list)

In [83]:
import pandas as pd
se = pd.Series({"men_id":"kiwi"})

In [84]:
se = pd.Series([1, 2, 3, 4, 5]) #리스트, 딕셔너리유형 모두 사용가능

특정값 추출 - values, index

In [85]:
print(se[0])
print(se[3])

1
4

In [86]:
# 파라미터에 딕셔너리, 튜플 모두 사용가능
se = pd.Series((1,2,3))

In [87]:
se[len(se)-1] == se[2]

np.True_

In [88]:
se = pd.Series([1, 2, 3, 4, 5])
se.index

RangeIndex(start=0, stop=5, step=1)

In [89]:
se.values # Series 안에 Numpy가 포함되어 있다.

array([1, 2, 3, 4, 5])

In [90]:
## index 변경
se.index = ['a', 'b', 'c', 'd', 'e']
se

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [91]:
print(se['a']) # 파이썬의 리스트와 넘파이 시리즈 혼동하지 말 것.

1

index 이름 명시하여 Series 생성하기

In [92]:
# Series 생성 2 - index 명시
# Series (파라미터1, 파라미터2, 파라미터3) - 이미 명명되어 있다.
se2 = pd.Series([1, 2, 3, 4, 5], index = ['a', 'b', 'c', 'd', 'e'])
se2.name = "numOrder" # value 이름
se2.index.name = "numName" # index 이름
se2

numName
a    1
b    2
c    3
d    4
e    5
Name: numOrder, dtype: int64

In [93]:
se2 > 2

numName
a    False
b    False
c     True
d     True
e     True
Name: numOrder, dtype: bool

In [94]:
se2[se2 >2]

numName
c    3
d    4
e    5
Name: numOrder, dtype: int64

In [95]:
se2[-(se2 > 2)]

numName
a    1
b    2
Name: numOrder, dtype: int64

DataFrame (데이터프레임)   
- Pandas에서 행과 열을 가지는 자료구조   
- 데이터프레임은 2차원이므로 행 방향 인덱스와 열 방향 인덱스가 존재   
- 데이터프레임은 열, 인덱스, 값으로 구성됨

In [96]:
data = {'name':['Lee', 'Park', 'Kim', 'Choi']
            , 'score':[85, 90, 100, 70,]
            , 'grade':['B', 'A', 'A', 'C']}
df = pd.DataFrame(data)
df

   name  score grade
0   Lee     85     B
1  Park     90     A
2   Kim    100     A
3  Choi     70     C

In [97]:
df = pd.DataFrame(data, columns=['name', 'grade', 'score'])
df

   name grade  score
0   Lee     B     85
1  Park     A     90
2   Kim     A    100
3  Choi     C     70

In [98]:
df.values # 대괄호가 2개 (array)

array([['Lee', 'B', 85],
       ['Park', 'A', 90],
       ['Kim', 'A', 100],
       ['Choi', 'C', 70]], dtype=object)

In [99]:
df.index.name = 'No'
df.columns.name = 'Info'
df

Info  name grade  score
No
0      Lee     B     85
1     Park     A     90
2      Kim     A    100
3     Choi     C     70

In [100]:
# 특정값 추출하기
df['name'].values # datatype 'object'는 Python에서 str or mixed

array(['Lee', 'Park', 'Kim', 'Choi'], dtype=object)

In [101]:
# 행렬 지정으로 특정값 출력
df.loc[1, 'name']

'Park'

In [102]:
df = df.set_index('name')
df.loc['Choi','grade']

'C'

In [103]:
# DataFrame을 딕셔너리로 변환
df.to_dict()

{'grade': {'Lee': 'B', 'Park': 'A', 'Kim': 'A', 'Choi': 'C'},
 'score': {'Lee': 85, 'Park': 90, 'Kim': 100, 'Choi': 70}}

In [104]:
import numpy as np
array = np.array([['Lee', 100, 'A',], ['Park', 95, 'A'],['Kim',85,'B']])
df = pd.DataFrame(data, columns=['name','score','grade'])
df

   name  score grade
0   Lee     85     B
1  Park     90     A
2   Kim    100     A
3  Choi     70     C

In [105]:
df.values

array([['Lee', 85, 'B'],
       ['Park', 90, 'A'],
       ['Kim', 100, 'A'],
       ['Choi', 70, 'C']], dtype=object)

데이터 셀렉션 및 필터링   
1) [   ] - 컬럼기반 필터링 또는 불린 인덱싱 필터링 제공   
    예: df,컬럼명, df['컬럼명], df[1:3] - 1행3열, df[:2]   
    
2) loc[인덱스명, 컬럼명] - 명칭(label) 기반 인덱싱   
     - index명, column명 기준으로 데이터가 조회됨.   
     예: 하나의 행만 검색할 때 - df.loc[0] (한 행만 가져옴)

In [106]:
df.name

0     Lee
1    Park
2     Kim
3    Choi
Name: name, dtype: object

In [107]:
df['name'] #상기와 동일한 표현식

0     Lee
1    Park
2     Kim
3    Choi
Name: name, dtype: object

In [108]:
df[1:3] #2개의 행이 나타남 - 0부터니까 3행은 포함 안됨
# 콜론 앞에 숫자는 시작되는 index이고 콜론 뒤 숫자는 미포함

   name  score grade
1  Park     90     A
2   Kim    100     A

In [109]:
df[:3]

   name  score grade
0   Lee     85     B
1  Park     90     A
2   Kim    100     A

In [110]:
df[:-1] #-1제외한 나머지 모두

   name  score grade
0   Lee     85     B
1  Park     90     A
2   Kim    100     A

In [111]:
df.describe

<bound method NDFrame.describe of    name  score grade
0   Lee     85     B
1  Park     90     A
2   Kim    100     A
3  Choi     70     C>

In [112]:
df.loc[1:5]

   name  score grade
1  Park     90     A
2   Kim    100     A
3  Choi     70     C

2) loc[인덱스명, 컬럼명] - 명칭(label) 기반 인덱싱   
     - index명, column명 기준으로 데이터가 조회됨.   
     예: 하나의 행만 검색할 때 - df.loc[0] (한 행만 가져옴)

In [113]:
df.loc[0]

name     Lee
score     85
grade      B
Name: 0, dtype: object

In [116]:
df.loc[[0,1]] #여러 행이 검색됨

   name  score grade
0   Lee     85     B
1  Park     90     A

In [117]:
df.loc[0:2, ['score','grade']] #여러 행과 열을 검색할 때

   score grade
0     85     B
1     90     A
2    100     A

In [118]:
# 여러 행과 열을 검색할 때
df.loc[0:2, ['score']]

   score
0     85
1     90
2    100

In [121]:
df.score

0     85
1     90
2    100
3     70
Name: score, dtype: int64

In [122]:
df.grade

0    B
1    A
2    A
3    C
Name: grade, dtype: object

In [127]:
df[['name','grade']]

   name grade
0   Lee     B
1  Park     A
2   Kim     A
3  Choi     C

In [128]:
df.loc[[0,2]] # 0 or 2nd column

  name  score grade
0  Lee     85     B
2  Kim    100     A

In [131]:
df.loc[0:2]

   name  score grade
0   Lee     85     B
1  Park     90     A
2   Kim    100     A

iloc[인덱스, 컬럼인덱스] - 위치기반 인덱싱   
- 0을 출발점으로 하는 가로축, 세로축 좌표 기반의 행과 열 위치를 기반으로 데이터를 지정   
- 행, 열 위치값으로 정수를 사용할 수 있음. 오직 인덱스 기준으로 데이터를 가져옴.

In [133]:
df.loc[3]

name     Choi
score      70
grade       C
Name: 3, dtype: object

In [134]:
df.iloc[1,0]

#loc gets rows (and/or columns) with particular labels.
#iloc gets rows (and/or columns) at integer locations.

'Park'

In [135]:
df.iloc[0:2]

   name  score grade
0   Lee     85     B
1  Park     90     A

In [136]:
df.iloc[0:2, 0:2]

   name  score
0   Lee     85
1  Park     90

4. Indexing Boolean

In [137]:
df.loc[df['score'] > 90]

  name  score grade
2  Kim    100     A

In [138]:
df

   name  score grade
0   Lee     85     B
1  Park     90     A
2   Kim    100     A
3  Choi     70     C

In [139]:
df.loc[df['grade'] == 'A']

   name  score grade
1  Park     90     A
2   Kim    100     A